InformationRegisters/Работники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>Работники</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаУвольнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Увольнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>Увольнение</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.РезультатИспытательногоСрока</xr:Item>
				<xr:Item>Document.УвольнениеИзОрганизаций</xr:Item>
				<xr:Item>Catalog.СотрудникиОрганизаций</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлановыеУдержанияРаботников</xr:Item>
				<xr:Item>InformationRegister.Работники</xr:Item>
				<xr:Item>AccumulationRegister.ЗанятыеРабочиеМеста</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисленияРаботников</xr:Item>
				<xr:Item>InformationRegister.ПериодыРаботыРаботников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУвольнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаУвольнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УвольнениеИзОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>УвольнениеИзОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<BasedOn>
				<xr:Item>Catalog.СотрудникиОрганизаций</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПериодыРаботыРаботниковОрганизацийПоОсновномуМестуРаботы</xr:Item>
				<xr:Item>InformationRegister.ПериодыРаботыРаботниковОрганизацийПоСовместительству</xr:Item>
				<xr:Item>AccumulationRegister.ЗанятыеШтатныеЕдиницыОрганизаций</xr:Item>
				<xr:Item>InformationRegister.РаботникиОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПлановыеНачисленияРаботниковОрганизаций</xr:Item>
				<xr:Item>InformationRegister.ПлановыеУдержанияРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Физлицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУвольнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяТКРФ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОснованияУвольненияИзОрганизации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеУвольнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрекращатьСтандартныеВычеты</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сторно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакКомпенсацииОтпуска</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокРасчетаОтпуска</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПорядокРасчетаОтпуска</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГодС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочийГодПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДнейЧасовКомпенсацииУдержанияОтпуска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПриказа</Name>
							<Comment>vvv</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПриказа</Name>
							<Comment>vvv</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/УченическиеДоговоры/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАДАЧ ПО УЧЕНИЧЕСКИМ ДОГОВОРАМ

// Функция формирует запрос по ученическим договорам
// В режиме печати документа формирует список обязательств по ученическим договорам
//
Функция СформироватьЗапросПоУченическимДоговорам(ДокументСсылка = Неопределено, ДатаПолученияФИО = '00010101') Экспорт
	
	ВестиОбучениеРазвитиеПоЦентрамОтветственности = ПолучитьФункциональнуюОпцию("ВестиОбучениеРазвитиеПоЦентрамОтветственности");
	
	Если ВестиОбучениеРазвитиеПоЦентрамОтветственности Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбязательстваРаботниковПоУченическимДоговорам.Период,
		|	Увольнение.Ссылка КАК Событие,
		|	ОбязательстваРаботниковПоУченическимДоговорам.ФизЛицо КАК ФизЛицо,
		|	ФИОФизЛицСрезПоследних.Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя,
		|	ФИОФизЛицСрезПоследних.Отчество,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыМероприятийАдаптацииУвольнения.Увольнение) КАК ВидМероприятий,
		|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
		|	РаботникиСрезПоследних.Подразделение КАК Подразделение,
		|	УченическийДоговор.Ссылка КАК УченическийДоговор,
		|	УченическийДоговор.Номер КАК НомерУчДоговора,
		|	УченическийДоговор.Дата КАК ДатаУчДоговора,
		|	ОбязательстваРаботниковПоУченическимДоговорам.Сумма КАК СуммаРасходов,
		|	ОбязательстваРаботниковПоУченическимДоговорам.Период КАК СрокИсполнения,
		|	ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.Расчетчик) КАК Роль,
		|	Увольнение.Номер КАК НомерПриказа,
		|	Увольнение.Дата КАК ДатаПриказа
		|ИЗ
		|	РегистрСведений.ОбязательстваРаботниковПоУченическимДоговорам.СрезПоследних(, Регистратор = &Регистратор) КАК ОбязательстваРаботниковПоУченическимДоговорам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Увольнение КАК Увольнение
		|		ПО ОбязательстваРаботниковПоУченическимДоговорам.Регистратор = Увольнение.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УченическийДоговор КАК УченическийДоговор
		|		ПО ОбязательстваРаботниковПоУченическимДоговорам.Договор = УченическийДоговор.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(, ) КАК РаботникиСрезПоследних
		|		ПО ОбязательстваРаботниковПоУченическимДоговорам.ФизЛицо = РаботникиСрезПоследних.ФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаПолученияФИО, ) КАК ФИОФизЛицСрезПоследних
		|		ПО ОбязательстваРаботниковПоУченическимДоговорам.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо";
	Иначе
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ОбязательстваРаботниковПоУченическимДоговорам.Период КАК Период,
		|	Увольнение.Ссылка КАК Событие,
		|	ОбязательстваРаботниковПоУченическимДоговорам.ФизЛицо КАК ФизЛицо,
		|	ФИОФизЛицСрезПоследних.Фамилия КАК Фамилия,
		|	ФИОФизЛицСрезПоследних.Имя КАК Имя,
		|	ФИОФизЛицСрезПоследних.Отчество КАК Отчество,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыМероприятийАдаптацииУвольнения.Увольнение) КАК ВидМероприятий,
		|	ОбязательстваРаботниковПоУченическимДоговорам.Организация,
		|	ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка) КАК Подразделение,
		|	УченическийДоговор.Ссылка КАК УченическийДоговор,
		|	УченическийДоговор.Номер КАК НомерУчДоговора,
		|	УченическийДоговор.Дата КАК ДатаУчДоговора,
		|	ОбязательстваРаботниковПоУченическимДоговорам.Сумма КАК СуммаРасходов,
		|	ОбязательстваРаботниковПоУченическимДоговорам.Период КАК СрокИсполнения,
		|	ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.Расчетчик) КАК Роль,
		|	Увольнение.Номер КАК НомерПриказа,
		|	Увольнение.Дата КАК ДатаПриказа
		|ИЗ
		|	РегистрСведений.ОбязательстваРаботниковПоУченическимДоговорам.СрезПоследних(, Регистратор = &Регистратор) КАК ОбязательстваРаботниковПоУченическимДоговорам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УвольнениеИзОрганизаций КАК Увольнение
		|		ПО ОбязательстваРаботниковПоУченическимДоговорам.Регистратор = Увольнение.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УченическийДоговор КАК УченическийДоговор
		|		ПО ОбязательстваРаботниковПоУченическимДоговорам.Договор = УченическийДоговор.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц.СрезПоследних(&ДатаПолученияФИО, ) КАК ФИОФизЛицСрезПоследних
		|		ПО ОбязательстваРаботниковПоУченическимДоговорам.ФизЛицо = ФИОФизЛицСрезПоследних.ФизЛицо";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаИсполнителя КАК Задачи
		|		ПО (Увольнение.Ссылка = Задачи.ОбъектЗадачи)
		|			И (Задачи.ВидЗадачи = ЗНАЧЕНИЕ(Справочник.ВидыЗадачПользователей.ОбязательстваПоУченическомуДоговору))
		|ГДЕ
		|	ОбязательстваРаботниковПоУченическимДоговорам.Погашено
		|	И Задачи.Ссылка ЕСТЬ NULL ";
	Иначе
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ
		|	ОбязательстваРаботниковПоУченическимДоговорам.Погашено
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбязательстваРаботниковПоУченическимДоговорам.НомерСтроки,
		|	НомерПриказа
		|ИТОГИ
		|	МАКСИМУМ(ФизЛицо),
		|	МАКСИМУМ(ОбязательстваРаботниковПоУченическимДоговорам.Период),
		|	МАКСИМУМ(НомерПриказа),
		|	МАКСИМУМ(ДатаПриказа)
		|ПО
		|	ФизЛицо,
		|	ВидМероприятий";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		Запрос.УстановитьПараметр("Регистратор", ДокументСсылка);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Регистратор = &Регистратор", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаПолученияФИО", ДатаПолученияФИО);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоУченическимДоговорам

Функция ПолучитьНаименованиеЗадачи(Выборка)
	
	ШаблонТекста = НСтр("ru = 'Удержание по ученическому договору №%3 от %4 с %1 в срок до %2'");
	НаименованиеЗадачи 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонТекста, 
		ОбщегоНазначенияЗК.ПредставлениеРаботника(Выборка.ФизЛицо, 2), Формат(Выборка.СрокИсполнения, "ДЛФ=DD"), Выборка.НомерУчДоговора, Формат(Выборка.ДатаУчДоговора, "ДЛФ=DD"));
	
	Возврат НаименованиеЗадачи;
	
КонецФункции // ПолучитьНаименованиеЗадачи

Процедура НазначениеЗадачПоУченическимДоговорам() Экспорт
	
	ВыборкаПоУченическимДоговорам = СформироватьЗапросПоУченическимДоговорам().Выбрать();
	
	Пока ВыборкаПоУченическимДоговорам.Следующий() Цикл
		
		ЗадачаПоУченическомуДоговору = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		ЗадачаПоУченическомуДоговору.Дата			= ВыборкаПоУченическимДоговорам.СрокИсполнения;
		ЗадачаПоУченическомуДоговору.ВидЗадачи		= Справочники.ВидыЗадачПользователей.ОбязательстваПоУченическомуДоговору;
		ЗадачаПоУченическомуДоговору.ОбъектЗадачи	= ВыборкаПоУченическимДоговорам.Событие;
		ЗадачаПоУченическомуДоговору.Наименование	= ПолучитьНаименованиеЗадачи(ВыборкаПоУченическимДоговорам);
		УправлениеЗадачами.ЗаписатьАдресациюЗадачи(ЗадачаПоУченическомуДоговору, ВыборкаПоУченическимДоговорам.Организация, ВыборкаПоУченическимДоговорам.Роль, ВыборкаПоУченическимДоговорам.Подразделение);
		ЗадачаПоУченическомуДоговору.Записать();
		
	КонецЦикла;
	
КонецПроцедуры // НазначениеЗадачПоУченическимДоговорам

// Процедура предназначена для отражения в учете погашения 
//  обязательств по ученическим договорам увольняемого сотрудника,
//  а также компенсации расходов связанных с обучением
//
Процедура ПогаситьОбязательстваПриУвольнении(Движения, ДокументУвольнениеСсылка) Экспорт
	
	Выборка = УченическиеДоговорыСервер.СформироватьЗапросПоОбязательствам(ДокументУвольнениеСсылка).Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОбязательстваРаботниковПоУченическимДоговорам.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // ПогаситьОбязательстваПриУвольнении
